/* ---------------------------------------------------------------------- */
/* Switch                                                                 */
/* ---------------------------------------------------------------------- */

const MORNING    = '아침',
      LUNCH      = '점심',
      DINNER     = '저녁',
      NIGHT      = '밤',
      LATE_NIGHT = '심야',
      DAWN       = '새벽';

let thisTime =  LUNCH ;


/* 다양한 상황에 맞게 처리 --------------------------------------------------- */

// 조건 유형(case): '아침'
// '뉴스 기사 글을 읽는다.'

// 조건 유형(case): '점심'
// '자주 가는 식당에 가서 식사를 한다.'

// 조건 유형(case): '저녁'
// '동네 한바퀴를 조깅한다.'

// 조건 유형(case): '밤'
// '친구에게 전화를 걸어 수다를 떤다.'

// 조건 유형(case): '심야'
// 조건 유형(case): '새벽'
// '한밤 중이거나, 새벽이니 아마도 꿈나라에 있을 것이다.'

let x = prompt("값을 입력해주세요.");

/*
switch(x){
  case '아침': 
  alert('뉴스 기사 글을 읽는다.');
  break;

  case '점심':
  alert('자주 가는 식당에 가서 식사를 한다.');
  break;

  case '저녁':
  alert('동네 한바퀴를 조깅한다.');
  break;

  case '밤':
  alert('친구에게 전화를 걸어 수다를 떤다.');
  break;

  case '심야':
  case '새벽':
  alert('한밤 중이거나, 새벽이니 아마도 꿈나라에 있을 것이다.');
  break;

  default:
  alert('알 수 없는 값을 입력하셨습니다.');
    
}
*/

/* switch문 → if문 변환 --------------------------------------------------- */

if (x==='아침'){
  console.log('뉴스 기사 글을 읽는다.');
}else if(x==='점심'){
  console.log('자주 가는 식당에 가서 식사를 한다.');
}else if(x==='저녁'){
  console.log('동네 한바퀴를 조깅한다.');
}else if(x==='밤'){
  console.log('친구에게 전화를 걸어 수다를 떤다.');
}else if(x==='심야' || x==='새벽'){
  console.log('한밤 중이거나, 새벽이니 아마도 꿈나라에 있을 것이다.');
}else{
  console.log('알 수 없는 값을 입력하셨습니다.');
}

/* switch vs. if -------------------------------------------------------- */

let number = 5;

function getDay(dayValue){

  switch(number){
    case 0 : '일'; break;
    case 1 : '월'; break;
    case 2 : '화'; break;
    case 3 : '수'; break;
    case 4 : '목'; break;
    case 5 : '금'; break;
    case 6 : '토'; break;
  }

}

// 0~6의 값을 받는다.



Math.round


